# ModuleSettings Properties

---
The ModuleSettings type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MacroLanguageType|  The Macro language type.
| Name|  The module name.
Top
#### Reference
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace